src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаУдалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыОктаграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУстановок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьБиометрию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУстановкуКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКарт</Name>
			<Comment>Виды карт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Именная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Comment>Используется для карт с типом Wallet</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниКартыВМесяцах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаНастройкиЭлектронныхКартWallet/Ext/Form/Module.bsl
&НаКлиенте
Перем АктивныйЭлемент;
&НаКлиенте
Перем НеАктивныйЭлемент;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИдПроекта", ИдПроектаДляРедактирования);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы <> Неопределено Тогда
			
		ПараметрыВнешнейСистемы.Свойство("ИдВебХука", ЭтотОбъект.ИдВебХука);
		ПараметрыВнешнейСистемы.Свойство("АдресAPI", ЭтотОбъект.АдресAPI);
				
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Используется		 = Истина;
		Объект.КлючПриложения	 = Новый УникальныйИдентификатор();
		Объект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet;
		СформироватьНаименование();
		
		Элементы.ГруппаWalletДополнительно.Группировка  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ВидКартыПоУмолчанию.МаксимальнаяШирина = 40;
		Элементы.КлючПриложенияДополнительно.МаксимальнаяШирина = 36;
		Элементы.НаименованиеДополнительно.МаксимальнаяШирина   = 40;
		
	КонецЕсли;
	
	ЭтотОбъект.ВидКартыПоУмолчанию = Константы.ВидКартыWalletПоУмолчанию.Получить();
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.АдресAPI) Тогда
		ЭтотОбъект.АдресAPI = "api.webcitrus.app";
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНастройкиWallet();
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПодключениеУстановлено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введены неверные данные авторизации",,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		
		Если Не РезультатПроверки Тогда 
			
			ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
			
			ПоказатьОповещениеПользователя("Wallet",, "Необходимо настроить внешнюю публикацию", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда      
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект),
		Нстр("ru='Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';en='Is necessary to log in to your account. Open private cabinet?'"), РежимДиалогаВопрос.ДаНет);          
		Отказ = Истина;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭтоОблако 
		И Не ЗначениеЗаполнено(Константы.ВнешняяПубликацияАдрес.Получить()) Тогда
		
		АдресПубликации = "https://cloud.stoma1c.ru/app/" + Формат(ПараметрыСеанса.ОбластьДанныхЗначение, "ЧГ=");
		Константы.ВнешняяПубликацияАдрес.Установить(АдресПубликации);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СообщениеОбОшибке = ""; 
	
	ВнешняяСистема = РеквизитФормыВЗначение("Объект");
	
	// При дальнейшей обработке используется адрес API, который мог быть еще не сохранен в параметрах.
	СохраненныеПараметры = ВнешняяСистема.Параметры.Получить();
	СохраненныеПараметры = ?(ТипЗнч(СохраненныеПараметры) = Тип("Структура"), СохраненныеПараметры, Новый Структура);
	СохраненныеПараметры.Вставить("АдресAPI", ЭтотОбъект.АдресAPI);
	
	ВнешняяСистема.Параметры = Новый ХранилищеЗначения(СохраненныеПараметры);
	
	// создать (обновить) внешнюю систему в crm и ретрансляторе
	СоздатьВнешнююСистемуВ_CRM(СообщениеОбОшибке, ВнешняяСистема);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,, Отказ);  
		Возврат;
		
	КонецЕсли;
	
	ОбработчикВебХука = "https://cloud.stoma1c.ru/api/hs/api/wallet/webhook?apikey=" + ВнешняяСистема.КлючПриложения; 
	
	Если Не ЗначениеЗаполнено(ИдВебХука) Тогда		
		
		// создаем вебхук
		Результат = Справочники.Карты.УстановитьВебХук(ВнешняяСистема, "ВсеСобытия", "*", ОбработчикВебХука);	
		
		Если Не Результат.Успешно Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки,,,, Отказ);	
			
		Иначе
			
			ЭтотОбъект.ИдВебХука = Результат.id;
			
			ДобавитьРеквизитВСтруктуру(ПараметрыВнешнейСистемы, "ИдВебХука", ЭтотОбъект.ИдВебХука);
			
		КонецЕсли;
		
	Иначе
		
		// обновляем вебхук
		Результат = Справочники.Карты.ОбновитьВебХук(ВнешняяСистема, ИдВебХука, ОбработчикВебХука);
		
		Если Не Результат.Успешно Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки,,,, Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.АдресAPI) Тогда
		ПараметрыВнешнейСистемы.Вставить("АдресAPI", ЭтотОбъект.АдресAPI);
	КонецЕсли;
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СОХРАНЕНИЕ_ВНЕШНЕЙ_СИСТЕМЫ", Объект.Ссылка);
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ИдКлиентаПриИзменении(Элемент)
	
	ОбновитьНастройкиWallet(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СекретКлиентаПриИзменении(Элемент)
	
	ОбновитьНастройкиWallet(Истина);  
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура АдресAPIПриИзменении(Элемент)
	
	ОбновитьНастройкиWallet(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "СкрытьПоказатьДополнительно".
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "РедактироватьВидКарты".
//
Процедура РедактироватьВидКарты(Команда)
	
	ИмяЭлемента = ТекущийЭлемент.Имя;
	
	Если СтрНайти(ИмяЭлемента, "КнопкаДобавить") Тогда 
				
		ОткрытьФорму("Справочник.ВидыКарт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("ТипКода", ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet"))),,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
		
	Иначе
		
		РедактироватьВидКартыОбработка(ИмяЭлемента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
// Процедура, обновляет настройки wallet.
//
Процедура ОбновитьНастройкиWallet(ПодключениеВнешнейСистемы = Ложь)
	
	ОчиститьСообщения();
	
	ПодключениеУстановлено = Ложь;
	
	АктивныйЭлемент   = Неопределено;
	НеАктивныйЭлемент = Неопределено;
	
	Результат = ОбновитьНастройкиWalletНаСервере(ПодключениеВнешнейСистемы);
	
	Если Результат.Успешно Тогда
		
		Если ЗначениеЗаполнено(Результат.ИдПроекта) 
			Или (ЗначениеЗаполнено(ИдПроектаДляРедактирования) И ВидыКарт.НайтиПоЗначению(ИдПроектаДляРедактирования) <> Неопределено) Тогда
			РедактироватьВидКартыОбработка(, ?(ЗначениеЗаполнено(ИдПроектаДляРедактирования), ИдПроектаДляРедактирования, Результат.ИдПроекта));
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);  
		КонецЕсли;
		
	КонецЕсли;
	
	ИдПроекта = ?(Результат.Свойство("ИдПроекта"), Результат.ИдПроекта, Неопределено); 
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ВидКартыПоУмолчанию) Тогда
		
		ЭтотОбъект.ВидКартыПоУмолчанию = ПолучитьВидКатыПоУмолчанию();				
		ВидКартыПоУмолчаниюПриИзмененииНаСервере(ЭтотОбъект.ВидКартыПоУмолчанию);
		
	КонецЕсли;
	
	Результат.Успешно = Результат.Успешно И ЗначениеЗаполнено(ИдПроекта);
	
	Элементы.ГруппаWalletНастройки.Видимость		 = Не Результат.Успешно;
	Элементы.ГруппаДополнительныеНастройки.Видимость = Результат.Успешно;
	Элементы.РедакторКарты.Видимость				 = Результат.Успешно;
	Элементы.ГруппаДополнительно.Видимость			 = Ложь;
	
	Элементы.ВидКартыПоУмолчанию.СписокВыбора.Очистить();
	Элементы.ВидКартыПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(ПолучитьДоступныеВидыЭлектронныхКарт());

КонецПроцедуры

&НаСервере
// Функция, обновляет настройки wallet на сервере.
//
Функция ОбновитьНастройкиWalletНаСервере(ПодключениеВнешнейСистемы = Ложь)
	
	Если ПустаяСтрока(Объект.ТокенДоступа) Или ПустаяСтрока(Объект.КлючШифрования) Тогда
		Возврат ПолучитьСтруктуруВозврата();  
	КонецЕсли;
	
	Результат = ПроверитьПодключениеИПолучитьВидыКартWallet();
	
	Если Не Результат.Успешно Тогда
		
		УправлениеИнтерфейсамиСервер.УдалитьПодчиненныеЭлементыГруппы(ЭтаФорма, Элементы.ГруппаВидыКартОбщая, Элементы.ГруппаВидыКартСтрока_Шаблон);         
		
	Иначе
		
		ПодключениеУстановлено = Истина;
		
		Если ПодключениеВнешнейСистемы = Истина Тогда
			Константы.ИспользоватьWallet.Установить(Истина);
		КонецЕсли;
		
		ЗаполнитьВидыКарт(Результат.ВидыКарт);
		СинхронизироватьВидыКарт(ВидыКарт);
		ВывестиВидыКартWallet(ВидыКарт);
		
		Результат.Вставить("ИдПроекта", ?(ЗначениеЗаполнено(ВидыКарт) И ВидыКарт[0].Значение <> "КнопкаДобавить", ВидыКарт[0].Значение, Неопределено));
		
		Если Объект.Ссылка.Пустая() Тогда
			Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
// Процедура, выполняет синхронизацию карт.
//
Процедура СинхронизироватьВидыКарт(ВидыКарт)
	
	Справочники.Карты.СинхронизироватьВидыКарт(ВидыКарт);
	
КонецПроцедуры

// Процедура, заполняет виды карт.
//
Процедура ЗаполнитьВидыКарт(ВидыКартWallet)
	
	ВидыКарт.Очистить();
	
	Для Каждого ВидКарты Из ВидыКартWallet Цикл
		ВидыКарт.Добавить(ВидКарты.id, ВидКарты.name);  
	КонецЦикла;
	
КонецПроцедуры

// Функция, выполняет синхронизацию видов карт.
//
Функция ПроверитьПодключениеИПолучитьВидыКартWallet()
	
	СтруктураВозврата = ПолучитьСтруктуруВозврата();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(ЭтотОбъект.АдресAPI,,,,,,Новый ЗащищенноеСоединениеOpenSSL()); 
		Заголовки  = Новый Соответствие;    
		Заголовки.Вставить("X-Client-Id"    , Объект.ТокенДоступа);
		Заголовки.Вставить("X-Client-Secret", Объект.КлючШифрования);
		ЗапросНаПолучениеСпискаКарт = Новый HTTPЗапрос("/v1/projects", Заголовки); 
		Результат = Соединение.Получить(ЗапросНаПолучениеСпискаКарт);          
		
	Исключение
		
		СтруктураВозврата.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат СтруктураВозврата;  
		
	КонецПопытки;
	
	ПараметрыJson = РазобратьJson(Результат);
	
	Если Результат.КодСостояния = 200 Тогда  
		
		СтруктураВозврата.Успешно  = Истина;
		СтруктураВозврата.ВидыКарт = ПараметрыJson.data;
		
		Возврат СтруктураВозврата;  
		
	Иначе
		
		СтруктураВозврата.ОписаниеОшибки = "Ошибка подключения: " + ПараметрыJson.error.message;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;  
	
КонецФункции

// Функция, возвращает структуру возврата.
//
Функция ПолучитьСтруктуруВозврата()
	
	Возврат Новый Структура("Успешно, ВидыКарт, ОписаниеОшибки", Ложь);
	
КонецФункции

// Функция - Разобрать json
//
// Параметры:
//  РезультатЗапроса -    - 
// 
// Возвращаемое значение:
//   - 
//
Функция РазобратьJson(РезультатЗапроса)
	
	ТекстJSON  = РезультатЗапроса.ПолучитьТелоКакСтроку();  
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ПараметрыJSON;
	
КонецФункции

&НаСервере
// Процедура, создает динамические элементы видов карт.
//
Процедура ВывестиВидыКартWallet(ВидыКарт)
	
	УправлениеИнтерфейсамиСервер.УдалитьПодчиненныеЭлементыГруппы(ЭтаФорма, Элементы.ГруппаВидыКартОбщая, Элементы.ГруппаВидыКартСтрока_Шаблон); 
	
	Родитель = Неопределено;
	
	ВидыКарт.Добавить("КнопкаДобавить", "Добавить вид карты");
	
	Для Индекс = 0 По ВидыКарт.Количество() - 1 Цикл
		
		ОстатокОтДеления = Индекс % 7; // по 7 элементов в строке
		
		Если ОстатокОтДеления = 0 Или Родитель = Неопределено Тогда
			Родитель = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаВидыКартСтрока_Шаблон, Индекс, Элементы.ГруппаВидыКартОбщая);
		КонецЕсли;
		
		ИдПроекта = ВидыКарт[Индекс].Значение;
		
		КоличествоКарт = ?(ИдПроекта = "КнопкаДобавить", Неопределено, КоличествоКартПроекта(ИдПроекта));
		
		Если Не ЗначениеЗаполнено(КоличествоКарт) Тогда
			ЗаголовокКнопки = ВидыКарт[Индекс].Представление;
		Иначе
			ЗаголовокКнопки = ВидыКарт[Индекс].Представление + СтрШаблон(" (%1)", ПолучитьСклоненияСтрокиПоЧислу("карта", КоличествоКарт, "", "ЧС=Количественное", "ПД=Именительный")[0]);
		КонецЕсли;
		
		НоваяГруппа = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаВидКарты_Шаблон, ИдПроекта, Родитель);
		НоваяКнопка = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.РедактироватьВидКарты_Шаблон, ИдПроекта, НоваяГруппа,, ЗаголовокКнопки, Ложь);   
		
		Если ИдПроекта = "КнопкаДобавить" Тогда
			
			НоваяКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
			НоваяКнопка.Картинка    = БиблиотекаКартинок.СоздатьЭлементСписка; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, возвращает количество карт в разрезе проекта.
//
Функция КоличествоКартПроекта(ИдПроекта)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|  КОЛИЧЕСТВО(Карты.Ссылка) КАК Количество
	|ИЗ
	|  Справочник.Карты КАК Карты
	|ГДЕ
	|  НЕ Карты.ПометкаУдаления
	|  И НЕ Карты.Заблокирована
	|  И Карты.ВидКарты.ИдентификаторПроекта = &ИдентификаторПроекта");
	
	Запрос.УстановитьПараметр("ИдентификаторПроекта", ИдПроекта); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Количество, 0);
	
КонецФункции

&НаКлиенте
// Процедура, открывает редактор карт.
//
Процедура РедактироватьВидКартыОбработка(ИмяЭлемента, ИдПроекта = Неопределено)
	
	Если ИдПроекта = Неопределено И Не СтрНайти(ИмяЭлемента, "РедактироватьВидКарты_") Тогда
		Возврат;  
	КонецЕсли;
	
	ИдПроекта       = ?(ЗначениеЗаполнено(ИдПроекта), ИдПроекта, СтрЗаменить(ТекущийЭлемент.Имя, "РедактироватьВидКарты_", ""));
	АктивныйЭлемент = Элементы["ГруппаВидКарты_" + ИдПроекта];
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, ?(АктивныйЭлемент = НеАктивныйЭлемент, Неопределено, НеАктивныйЭлемент),, ЭтаФорма, Элементы.РедакторКарты);  
	
	НеАктивныйЭлемент = АктивныйЭлемент;
	
	РедакторКарты = СтрШаблон("https://webcitrus.app/tools/%1/pass-designer/%2?client_secret=%3&1c", Объект.ТокенДоступа, ИдПроекта, Объект.КлючШифрования);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

// Процедура - Установить служебного пользователя
//
&НаСервереБезКонтекста
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Создать внешнюю систему
//
Функция СоздатьВнешнююСистемуВ_CRM(СообщениеОбОшибке = Неопределено, ВнешняяСистема)
	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		СообщениеОбОшибке = РезультатЗапроса.ОписаниеОшибки;    
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОРегистрацииВЛК(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненВходВЛичныйКабинет" Тогда
		
		УидСессии = ЛичныйКабинет.УидТекущейСессии();  
		
	ИначеЕсли ИмяСобытия = "ДобавленИзмененВидКарт" Тогда
		
		Если Параметр = Истина Тогда
			
			ОбновитьНастройкиWallet();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "КлючПриложенияДополнительноПриИзменении".
//
Процедура КлючПриложенияДополнительноПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервере
// Процедура, формирует наименование.
//
Процедура СформироватьНаименование()
	
	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + "-" + Объект.КлючПриложения; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоматическиВыдаватьКартуПриПервойПокупкеПриИзменении".
//
Процедура АвтоматическиВыдаватьКартуПриПервойПокупкеПриИзменении(Элемент)
	
	Элементы.КаналРассылкиКарты.Видимость = ЭтотОбъект.АвтоматическиВыдаватьКартуПриПокупке;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияНастройкиНажатие".
//
Процедура ДекорацияНастройкиНажатие(Элемент)
	
	МассивСоответствий = Новый Массив();
	
	Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) 
		И ПараметрыВнешнейСистемы.Свойство("ВидыКартПоУмолчанию") Тогда
		
		МассивСоответствий = ПараметрыВнешнейСистемы.ВидыКартПоУмолчанию.МассивСоответствий;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивСоответствий) Тогда
		
		ПустоеЗначение = Новый Структура("СтруктурнаяЕдиница, ВидКарты", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка"), ПредопределенноеЗначение("Справочник.ВидыКарт.ПустаяСсылка"));
		
		МассивСоответствий = Новый_Массив(ПустоеЗначение);
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыКарт.Форма.ФормаИмпортаПроектов", Новый Структура("ВидыКарт", МассивСоответствий),,,,, Новый ОписаниеОповещения("ИмпортПроектовЗавершение", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения "ИмпортПроектовЗавершение" .
//
Процедура ИмпортПроектовЗавершение(МассивСоответствий, Контекст) Экспорт
	
	Если МассивСоответствий <> Неопределено Тогда
		
		ВидыКартПоУмолчанию = Новый Структура("МассивСоответствий", МассивСоответствий);
		
		Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда
			
			ПараметрыВнешнейСистемы = Новый Структура();	
			
		КонецЕсли;
		
		ДобавитьРеквизитВСтруктуру(ПараметрыВнешнейСистемы, "ВидыКартПоУмолчанию", ЭтотОбъект.ВидыКартПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает доступные виды карт.
//
Функция ПолучитьДоступныеВидыЭлектронныхКарт()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	НЕ ВидыКарт.ПометкаУдаления
	|	И ИдентификаторПроекта <> 0");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, обработчик события "ВидКартыПоУмолчаниюПриИзмененииНаСервере".
//
Процедура ВидКартыПоУмолчаниюПриИзмененииНаСервере(ВидКартыПоУмолчанию)
	
	Если Константы.ВидКартыWalletПоУмолчанию.Получить() <> ВидКартыПоУмолчанию Тогда		
		Константы.ВидКартыWalletПоУмолчанию.Установить(ВидКартыПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ВидКартыПоУмолчаниюПриИзменении".
//
Процедура ВидКартыПоУмолчаниюПриИзменении(Элемент)
	
	ВидКартыПоУмолчаниюПриИзмененииНаСервере(ЭтотОбъект.ВидКартыПоУмолчанию);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает вид карты wallet по умолчанию.
//
Функция ПолучитьВидКатыПоУмолчанию()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	НЕ ВидыКарт.ПометкаУдаления
	|	И ВидыКарт.ИдентификаторПроекта <> 0");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура, добавляет реквизит в структуру.
//
Процедура ДобавитьРеквизитВСтруктуру(ПараметрыВнешнейСистемы, НаименованиеРеквизита, ЗначениеРеквизита)
	
	Если ПараметрыВнешнейСистемы.Свойство(НаименованиеРеквизита) Тогда
		ПараметрыВнешнейСистемы[НаименованиеРеквизита] = ЗначениеРеквизита;
	Иначе
		ПараметрыВнешнейСистемы.Вставить(НаименованиеРеквизита, ЗначениеРеквизита); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
